---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.WinderTooManyStartParallelTreadsOrRunWidthFailure
source: html/36505e1b-eeaf-89c4-255f-e84093c4f2ba.htm
---
# Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.WinderTooManyStartParallelTreadsOrRunWidthFailure Property

The number of parallel treads at start is too great or the run width is too great.

## Syntax (C#)
```csharp
public static FailureDefinitionId WinderTooManyStartParallelTreadsOrRunWidthFailure { get; }
```